app/Models/Dealer_Model.php

SELECT *
FROM `dealerdepartment` `dd`
JOIN `department` `d` ON `d`.`DepartmentId`=`dd`.`DepartmentId`
WHERE `DealerId` = '1'
GROUP BY `d`.`DepartmentId`
---
  public function getdealerdepartment($dealerid,$city){
  $city = strtolower($city)== "mysore" ? "" : strtolower($city)."_";

    $db = db_connect();
     return $db->table($city.'dealerdepartment dd')->select('*')->join("department d","d.DepartmentId=dd.DepartmentId") ->where('DealerId', $dealerid)->groupBy('d.DepartmentId')->get()->getResult();

SELECT *
FROM `maincategory`
WHERE `DepartmentId` = '3'
---
public function maincategory($departid){


    $db = db_connect();
     return $db->table('maincategory')->select('*')->where('DepartmentId', $departid)->get()->getResult();

SELECT *
FROM `subcategory` `s`
JOIN `maincategory` `m` ON `s`.`MainCategoryId`=`m`.`MainCategoryId`
WHERE `s`.`MainCategoryId` = '9'
---
   public function subcategory($departid){


    $db = db_connect();
     return $db->table('subcategory s')->select('*')->join('maincategory m','s.MainCategoryId=m.MainCategoryId')->where('s.MainCategoryId', $departid)->get()->getResult();

SELECT `p`.`ProductId`, `p`.`BrandId`, `p`.`ProductName`, `b`.`BrandName`, `p`.`DepartmentId`, `p`.`MainCategoryId`, `p`.`SubCategoryId`, `MRP`, `SellingPrice`, `ProductCode`, `StorePrice`, `Image1`, `dp`.`DealerPriceId`, `ds`.`SpecificationValue`
FROM `dealerprice` `dp`
JOIN `products` `p` ON `dp`.`ProductId`=`p`.`ProductId`
LEFT JOIN `dealerproductspecification` `ds` ON `dp`.`DealerPriceId`=`ds`.`DealerPriceId`
JOIN `brands` `b` ON `p`.`BrandId`=`b`.`BrandId`
WHERE `dp`.`DealerId` = '1'
AND `p`.`BrandType` = 1
GROUP BY `dp`.`DealerPriceId`
 LIMIT 10
---
public function dealercatnobrandedproduct($dealerid,$cityname){
  $city = strtolower($cityname)== "mysore" ? "" : strtolower($cityname)."_";
    $db = db_connect();

return $db->table($city.'dealerprice dp')
       ->select('p.ProductId,p.BrandId,p.ProductName,b.BrandName,p.DepartmentId,p.MainCategoryId,p.SubCategoryId,MRP,SellingPrice,ProductCode,StorePrice,Image1,dp.DealerPriceId,ds.SpecificationValue')
       ->where('dp.DealerId',$dealerid)
     ->join('products p', 'dp.ProductId=p.ProductId')
     ->join($city.'dealerproductspecification ds', 'dp.DealerPriceId=ds.DealerPriceId',"left")
       ->join('brands b', 'p.BrandId=b.BrandId')
       ->where('p.BrandType',1)
->groupBy('dp.DealerPriceId')
       ->limit(10,0)->get()->getResult();