app/Models/ProductModel.php

SELECT *
FROM `gst_slabs`
WHERE `ActiveStatus` = 1
---
    public function getgstslab(){
        $db = db_connect();
                 return $db->table('gst_slabs')->select('*')->where('ActiveStatus', 1)->get()->getResult();

SELECT MIN(dp.SellingPrice) as MRP, MIN(dp.StorePrice) as LowestStorePrice, (MRP) as LowestStorePrice
FROM `products` `p`
JOIN `dealerprice` `dp` ON `dp`.`ProductId`=`p`.`ProductId`
WHERE `p`.`ProductId` = '805044'
GROUP BY `p`.`ProductId`
---
    function pricedetail($id,$city){
        $db = db_connect();
        return $db->table('products p')
        ->select('MIN(dp.SellingPrice) as MRP,MIN(dp.StorePrice) as LowestStorePrice,(MRP) as LowestStorePrice')
    ->join($city.'dealerprice dp', 'dp.ProductId=p.ProductId')
       ->where('p.ProductId', $id)
        ->groupBy('p.ProductId')
        ->get()->getRow();

SELECT *
FROM `products` `p`
JOIN `brands` `b` ON `b`.`BrandId` = `p`.`BrandId`
WHERE `p`.`ProductId` = '805044'
GROUP BY `p`.`ProductId`
---
 function productdetail($id){
        $db = db_connect();
        return $db->table('products p')
        ->select('*')
        ->join('brands b', 'b.BrandId = p.BrandId')

        ->where('p.ProductId', $id)
        ->groupBy('p.ProductId')
        ->get()->getRow();