app/Models/ProductViewCountModel.php

    function index($city)
    {
        $db = db_connect();
        return $db->table($city.$this->table. ' pvc')->join('products p', 'p.ProductId=pvc.ProductId')->orderBy('ViewCount','desc')->limit(30,0)->get()->getResult();
---
SELECT *
FROM `productviewcount` `pvc`
JOIN `products` `p` ON `p`.`ProductId`=`pvc`.`ProductId`
ORDER BY `ViewCount` DESC
 LIMIT 30