app/Models/StoreModel.php

SELECT `mc`.`MainCategoryName`, `mc`.`MainCategoryId`
FROM `dealerprice` `dp`
JOIN `products` `p` ON `p`.`ProductId`=`dp`.`ProductId`
JOIN `maincategory` `mc` ON `mc`.`MainCategoryId`=`p`.`MainCategoryId`
JOIN `dealerdepartment` `dd` ON `dd`.`DepartmentId` = `p`.`DepartmentId`
WHERE `dp`.`DealerId` = '1'
AND `dp`.`ActiveStatus` = 1
GROUP BY `mc`.`MainCategoryId`
---
    function storefrontcategory($id,$city)
	{
        $db = db_connect();
        return $db->table($city.'dealerprice dp')
		->select('mc.MainCategoryName,mc.MainCategoryId')
		->where('dp.DealerId', $id)
		->where('dp.ActiveStatus', 1)
		->join('products p', 'p.ProductId=dp.ProductId')
		->join('maincategory mc', 'mc.MainCategoryId=p.MainCategoryId')
		->join('dealerdepartment dd', 'dd.DepartmentId = p.DepartmentId')
        ->groupBy('mc.MainCategoryId')
       ->get()->getResult();

SELECT *
FROM `dealerprice` `dp`
JOIN `products` `p` ON `p`.`ProductId`=`dp`.`ProductId`
WHERE `dp`.`DealerId` = '1'
AND `dp`.`QuantityAvailable` > 0
AND `dp`.`ActiveStatus` = 1
AND `p`.`MainCategoryId` = '16'
GROUP BY `dp`.`ProductId`
ORDER BY `dp`.`DealerPriceId` DESC
 LIMIT 2
---
    function storefrontcategoryProduct($id,$maincategoryid,$city){
        $db = db_connect();
        return $db->table($city.'dealerprice dp')
        ->select('*')
		->where('dp.DealerId', $id)
		->where('dp.QuantityAvailable > ', 0)
		->where('dp.ActiveStatus',1)
		->join('products p', 'p.ProductId=dp.ProductId')
	->where('p.MainCategoryId', $maincategoryid)
		->groupBy('dp.ProductId')
		->orderBy('dp.DealerPriceId', 'desc')
        ->limit(2,0)->get()->getResult();